app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(:page => params[:page], :per_page => 5).order('created_at DESC')
---
SELECT * FROM "posts" ORDER BY created_at DESC

  def create
    @post = Post.new(params[:post])
    @post.tags << Tag.find(params[:tag][:tag_id])
---
INSERT INTO "posts" ("created_at", "title", "body") VALUES('2010-04-05 03:30:01', 'Yes one more Easter', 'I must say that this day was a total chaos starting from early in the morning....
SELECT * FROM "tags" WHERE ("tags"."id" = 2)

  def update
    post = Post.find(params[:id])
    if post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = '--- :post
UPDATE "posts" SET "body" = 'thehehe hdh' WHERE "id" = 3

  def destroy
    if Post.destroy(params[:id])
---
DELETE FROM "posts" WHERE "id" = 1