app/controllers/tags_controller.rb

SELECT * FROM "tags"
---
  def index
    @tags = Tag.all

INSERT INTO "tags" ("name") VALUES('Leisure')
---
  def create
    @tag = Tag.new(params[:tag])
    if @tag.save