app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', '22c9a3487a9601a174c008b59767c363608cc820', '2010-04-03 20:01:50', '16495d641c12661a5f3d432f5b0197f94df90d69', NULL, '2010-04-03 20:01:50', NULL, 'lsaffie', 'jose_luisu@hotmail.com')